# Dependency management
brew "mas"

# Core tools
cask "kitty"
brew "git"
brew "stow"
brew "fish"
brew "fisher"
brew "nvim"
brew "tmux"
brew "openssh"
brew "gnupg"
brew "bash"
brew "coreutils"

# Extra utilities
brew "fzf"
brew "the_silver_searcher"
brew "ripgrep"
brew "htop"
brew "jq"
brew "yq"
brew "diff-so-fancy"
cask "fork"
brew "k3d"
cask "tunnelblick"
cask "aws-vault"
brew "bat"
brew "argo"
brew "stern"
brew "sponge"
cask "poedit"
brew "imagemagick"
brew "ctop"
brew "tree"
brew "wget"

# Productivity
cask "alfred"
cask "mimestream"
mas "Slack", id: 803453959
mas "Moom", id: 419330170
mas "1password", id: 1333542190

# For Tmux
tap "kjagiello/wifi"
tap "goles/battery"

brew "battery"
brew "tmux-mem-cpu-load"
brew "wifi"

# Languages
brew "rustup"
brew "pyenv"
brew "universal-ctags"
brew "go"
